In [1]:
import pandas as pd
import numpy as np

In [ ]:
iris = pd.read_csv("https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/639388c2cbc2120a14dcf466e85730eb8be498bb/iris.csv")

In [ ]:
iris

In [ ]:
iris.info()

In [ ]:
#Value Counts

In [ ]:
iris["species"].value_counts()

In [ ]:
iris.value_counts()

In [ ]:
#Group By, 1 aggregation

In [ ]:
iris.groupby("species").max()

In [ ]:
iris.groupby("species").min()

In [ ]:
iris.groupby("species").sum()

In [ ]:
iris.groupby("species").mean()

In [ ]:
iris.groupby("species").median()

In [ ]:
iris.groupby("species").count()

In [ ]:
iris.groupby("species").size()

In [ ]:
iris.groupby("species").describe()

In [ ]:
iris.groupby("species").describe().T

In [ ]:
iris.groupby("species").agg(["mean", "min", "sum"])

In [ ]:
iris.groupby("species").agg({"sepal_width": ["min", "max"], "petal_width": "mean"})

In [ ]:
iris.groupby(["species", "petal_length"]).min()

In [ ]:
iris.groupby(iris["petal_length"]>5).mean()

In [ ]:
## Data Merging

In [ ]:
# Concat

In [2]:
df1 = pd.DataFrame({
    "cust_id": ["C1", "C2", "C3", "C4", "C5"],
    "item_bought": [10,15,20,35,4],
    "city": ["Bandung", "Jakarta", "Bogor", "Tangerang", "Bali"]
    })
df1

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [3]:
df2 = pd.DataFrame({
    "cust_id": ["C6", "C7", "C8"],
    "item_bought": [12,20,6],
    "city": ["Bandung", "Jakarta", "Jakarta"]
    })
df2

  cust_id  item_bought     city
0      C6           12  Bandung
1      C7           20  Jakarta
2      C8            6  Jakarta

In [4]:
df3 = pd.DataFrame({
    "cust_no": ["C1", "C2", "C3", "C5", "C6", "C7", "C8"],
    "age": [24,31,23,40,35,28,34]
    })
df3

  cust_no  age
0      C1   24
1      C2   31
2      C3   23
3      C5   40
4      C6   35
5      C7   28
6      C8   34

In [ ]:
#Concat axis = 0

In [ ]:
df_concat0 = pd.concat([df1, df2])
df_concat0

In [ ]:
#Concat axis = 1

In [ ]:
df_concat1 = pd.concat([df1, df3], axis = 1)
df_concat1

In [ ]:
# Merge

In [5]:
df1.merge(df3, left_on = "cust_id", right_on = "cust_no")

  cust_id  item_bought     city cust_no  age
0      C1           10  Bandung      C1   24
1      C2           15  Jakarta      C2   31
2      C3           20    Bogor      C3   23
3      C5            4     Bali      C5   40

In [6]:
df1.merge(df3, how = "left", left_on = "cust_id", right_on = "cust_no")

  cust_id  item_bought       city cust_no   age
0      C1           10    Bandung      C1  24.0
1      C2           15    Jakarta      C2  31.0
2      C3           20      Bogor      C3  23.0
3      C4           35  Tangerang     NaN   NaN
4      C5            4       Bali      C5  40.0

In [ ]:
df1.merge(df3, how = "right", left_on = "cust_id", right_on = "cust_no")

In [ ]:
df1.merge(df3, how = "inner", left_on = "cust_id", right_on = "cust_no")

In [ ]:
df1.merge(df3, how = "outer", left_on = "cust_id", right_on = "cust_no")

In [ ]:
df1.merge(df3, how = "outer", left_on = "cust_id", right_on = "cust_no").drop(columns = "cust_no")

In [ ]:
# Pivot

In [ ]:
iris.pivot_table(index =['petal_length'], columns ='species', values =["sepal_length", "sepal_width"], aggfunc = "mean")

In [ ]:
iris.pivot_table(index =['petal_length'], columns ='species', values =["sepal_length", "sepal_width"], aggfunc = "mean", fill_value = 0)

In [ ]:
iris.pivot_table(index =['petal_length'], columns ='species', values =["sepal_length", "sepal_width"], aggfunc = len, fill_value = 0)

In [ ]:
# Apply & Map Method

In [5]:
df = pd.DataFrame({ 'A': [1,2,3,4], 
                   'B': [10,20,30,40],
                   'C': [20,40,60,80]
                  }, 
                  index=['Row 1', 'Row 2', 'Row 3', 'Row 4'])
df

       A   B   C
Row 1  1  10  20
Row 2  2  20  40
Row 3  3  30  60
Row 4  4  40  80

In [6]:
def custom_sum(row):
    return row.sum()
df['D'] = df.apply(custom_sum, axis=1)

In [7]:
df

       A   B   C    D
Row 1  1  10  20   31
Row 2  2  20  40   62
Row 3  3  30  60   93
Row 4  4  40  80  124

In [8]:
df.loc['Row 5'] = df.apply(custom_sum, axis=0)
df

        A    B    C    D
Row 1   1   10   20   31
Row 2   2   20   40   62
Row 3   3   30   60   93
Row 4   4   40   80  124
Row 5  10  100  200  310

In [ ]:
def multiply_by_2(val):
    return val * 2
df['D'] = df['C'].apply(multiply_by_2)

In [ ]:
df

In [ ]:
df['D'] = df.apply(lambda x:x.sum(), axis=1)

In [ ]:
df.loc['Row 5'] = df.apply(lambda x:x.sum(), axis=0)

In [ ]:
df['D'] = df['C'].apply(lambda x:x*2)

In [ ]:
df.applymap(np.square)

In [ ]:
s = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
s

In [ ]:
s.map({'cat': 'kitten', 'dog': 'puppy'})

In [ ]:
s.map('I am a {}'.format)

In [ ]:
s.map('I am a {}'.format, na_action='ignore')

In [ ]:
#DateTime

In [ ]:
import datetime

dti = pd.to_datetime(
    ["1/1/2018", np.datetime64("2018-01-01"), datetime.datetime(2018, 1, 1)]
)
dti

In [ ]:
dti = pd.date_range("2018-01-01", periods=3, freq="H")

dti

In [ ]:
dti = dti.tz_localize("UTC")
dti

In [ ]:
dti.tz_convert("US/Pacific")